# Taps
tap "bloznelis/tap"
tap "hashicorp/tap"
tap "tgotwig/linux-dust"
tap "jesseduffield/lazydocker"
tap "jesseduffield/lazynpm"
tap "ariga/tap"
tap "joerdav/xc"
tap "dbcli/tap"
tap "oleiade/tap"
tap "lfaoro/tap"

# Formulae
brew "ots"
brew "yq"
brew "jq"
brew "gcc"
brew "age-plugin-yubikey"
brew "atlas"
brew "ast-grep"
brew "bandwhich"
brew "bat"
brew "biome"
brew "broot"
brew "btop"
brew "chezmoi"
brew "circumflex"
brew "clipboard"
brew "convco"
brew "croc"
brew "deno"
brew "diskus"
brew "duf"
brew "dust"
brew "ffmpeg"
brew "flint-checker"
brew "gh"
brew "git-delta"
brew "gitleaks"
brew "glab"
brew "glow"
brew "golang-migrate"
brew "gping"
brew "gum"
brew "helix"
brew "hurl"
brew "lazydocker"
brew "just"
brew "lazygit"
brew "lefthook"
brew "macchina"
brew "magic-wormhole"
brew "mkcert"
brew "navi"
brew "node"
brew "pass"
brew "pueue"
brew "restic"
brew "rmlint"
brew "ruff"
brew "scc"
brew "s-search"
brew "starship"
brew "tailspin"
brew "tealdeer"
brew "tesseract"
brew "typos-cli"
brew "typst"
brew "uv"
brew "xh"
brew "yaml-language-server"
brew "wakeonlan"
brew "hugo"
brew "sqlc"
brew "hyperfine"
brew "mise"
brew "yazi"
brew "xc"
brew "pipx"
brew "doggo"
brew "dotenv-linter"
brew "gitlab-ci-local"
brew "git-cliff"
brew "gobackup"
brew "litecli"
brew "television"
brew "step"
brew "duckdb"
brew "rink"
brew "iredis"
brew "dufs"
brew "openai-whisper"
brew "fnm"
brew "minijinja-cli"
brew "lxc"
brew "renameutils"
brew "poppler"
brew "pandoc"
brew "ripgrep-all"
brew "markdown-oxide"
brew "sk"
brew "dprint"
brew "shfmt"
brew "hunspell"
brew "viu"
brew "lfaoro/tap/ssm"
brew "hadolint"
brew "cosign"
brew "xxhash"
brew "topgrade"
brew "static-web-server"
brew "git-quick-stats"
brew "spark"
brew "pnpm"
brew "bitwarden-cli"
brew "asciidoctor"
brew "qrtool"
brew "fx"
brew "motus"
brew "vdirsyncer"
brew "todoman"
brew "jless"
brew "mprocs"
brew "dua-cli"
brew "gitui"
brew "atuin"
brew "git-absorb"
brew "nushell"
brew "fzf-make"
brew "ocrmypdf"
brew "djvulibre"

# VS Code Extensions
# vscode "ahmadalli.vscode-nginx-conf"
vscode "anthropic.claude-code"
# vscode "biomejs.biome"
# vscode "bmalehorn.vscode-fish"
vscode "bradlc.vscode-tailwindcss"
# vscode "budparr.language-hugo-vscode"
vscode "cweijan.dbclient-jdbc"
vscode "cweijan.duckdb-packs"
vscode "cweijan.vscode-mysql-client2"
vscode "docker.docker"
vscode "editorconfig.editorconfig"
vscode "github.vscode-github-actions"
vscode "gitlab.gitlab-workflow"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "hverlin.mise-vscode"
vscode "loriscro.super"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.dotnet-interactive-vscode"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.wasm-wasi-core"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-sqlite"
vscode "nvarner.typst-lsp"
vscode "openai.chatgpt"
vscode "pkl.pkl-vscode"
vscode "randomfractalsinc.duckdb-sql-tools"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "skellock.just"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vitest.explorer"
vscode "vue.volar"
